var xinm = ["张军","万燕","陈聃","邵娴","陈叙慈","戴汉春","杨竹山","刘浩","王芳","张国虎","杨辉","马兰珍","彭胡","杨慕紫萱","向鸥","钟婷玉","陈娟","杨威","胡正雄","李梦","李丹","唐蕾","何金枝","王露","杨莹","郭海娇","钟柏楠","张欣","徐云","刘中君","王平","陈子源","王丽萍","刘家安","张霞","田梓煜","肖振","包颖","朱伟","彭媛","徐云","阮万江","李统","戴礼超","叶建华","王维","张思雨","金铭煌","李智","周丹","郭⒃","邓宇培","孙玉琴","李斌","朱琪","贺岚","杨芳","白娟","何华","杨娟","金吉红","徐伟","杨德军","彭天桥","叶南","何胜兰","潘启华","赵鹏","熊思源","胡蝶","张国良","付才荣","方琪","李颖","张哲","吴小群","王亲","李金","毛玉琴","刘翠峰","蔡俊","赵思明","陈倩","曾仕豪","陈彩霞","程诗曼","刘婷","吴红","吴晓波","张选","张照君","安佳欢","张盼","张艳平","雷聪","李晓丽","李希阳","李雁茹","施瑜","刘睿","乐威","卢亚芳","姚少娟","吕海伟","朱恒","段伟","杨思莹","胡尧","刘洋","毛家豪","吴雷","聂萍","皮朝霞","钟学俊","金咪","任珍珍","汪慧","邹玄","赵丹","王曼","张锦","唐欢","邢玉凤","陆佳盼","项利芹","王能豪","杨婷","张艳","申海丽","曹军梅","刘超","张蝶","陈丹","李帆","杨婷","徐海青","肖声云","翁仁贵","邓美平","伍厚静","周叶","计恋","贾萌","何婷","方莉","余萍","刘丹","张琼","吴芸","陈秋艳","吕霁","黎吴霞","刘依凡","黄蕾","许可","许洪舟","张翔","陈章","邱盛川","许梦华","张杰","李澄","吴春凤","骆聪","张婷","王爱玲","王枝","谭寒露","李成浩","张婷婷","聂蓉","刘彬","潘曼曼","黄梦怡","李梦蓉","何雅玉","王艳芹","谢丽环","陈雪","李亚丽","李子昂","祝海珍","罗润","周平","董飞亚","廖颖兰","唐倬","彭瑾","陈眺","何华斌","彭威","肖召召","张文芳","万文晗","叶秀君","邱盛钰","覃庆利","袁翔","刘承溪","程施慧","黄兵","杨彦平","陈刚","费保桥","孙伟","翁磊","李响","孙俊涛","夏斌","向晶","吴翔","张谦","鄢得爱","童健","欧阳淼","胡牧","屈东","杨爱国","胡凤","吴明","陈实","毛春芳","李志勇","陈武川","杨雄","魏汉国","沙斌","谢劲华","黄卫春","牛顿","陈俊","杨一民","李敏","顾轶群","曾震宇","孙静","罗萍","罗钰","刘慧萍"]


var nametxt = $('.name');
var pcount = xinm.length-1;//参加人数
var runing = true;
var td = 1;//内定中奖,从最小奖开始，共10个名额
var num = 0;
var t;
//开始停止
function start() {
	if (runing) {
		runing = false;
		$('#btntxt').removeClass('start').addClass('stop');
		$('#btntxt').html('停止');
		startNum()
	} else {
		runing = true;
		$('#btntxt').removeClass('stop').addClass('start');
		$('#btntxt').html('开始');
		stop();
		zd();//内定中奖
	}
}
//循环参加名单
function startNum() {
	num = Math.floor(Math.random() * pcount);
	nametxt.html(xinm[num]);
	t = setTimeout(startNum, 0);
}
//停止跳动
function stop() {
	pcount = xinm.length-1;
	clearInterval(t);
	t = 0;
}
//从一等奖开始指定前3名
function zd() {
	$('.list').prepend("<p>"+td+' '+xinm[num]+"</p>");
	xinm.splice($.inArray(xinm[num], xinm), 1);
	td +=1;
}
